import Mirror from '../../util/mirror';

//  npm run test __tests__/util/mirror.spec.tsx
test("反転無し", () => {
    expect(Mirror(0, [[1,2,3],[4,5,6],[7,8,9]]))
    .toEqual([[1,2,3],[4,5,6],[7,8,9]]);
});

test("横軸対象反転", () => {
    expect(Mirror(1, [[1,2,3],[4,5,6],[7,8,9]]))
    .toEqual([[7,8,9],[4,5,6],[1,2,3]]);
});

test("縦軸対象反転", () => {
    expect(Mirror(2, [[1,2,3],[4,5,6],[7,8,9]]))
    .toEqual([[3,2,1],[6,5,4],[9,8,7]]);
});

test("右上斜軸対象反転", () => {
    expect(Mirror(3, [[1,2,3],[4,5,6],[7,8,9]]))
    .toEqual([[9,6,3],[8,5,2],[7,4,1]]);
});

test("右下斜軸対象反転", () => {
    expect(Mirror(4, [[1,2,3],[4,5,6],[7,8,9]]))
    .toEqual([[1,4,7],[2,5,8],[3,6,9]]);
});